//
//  记录.swift
//  StudyLeetcodeProject
//
//  Created by beliefduan on 2022/9/4.
//

import Foundation


/**
 基础数据结构
     数组双指针
        - 二分搜索
            1011
            875
            852
            793
            34
            704
            392
            354
            74
            35
        - 滑动窗口 ✅
        - 其他
            88
            80
            259
            240
            986
            18
            16
            977
            1099
     链表双指针 ✅
     前缀和
        1352
        1314
        327
        303
        370
     队列、栈算法 ✅
     二叉堆
        1845
        1834
        703
        295
     数据结构设计
        1845
        895
        341
 数据结构进阶
    二叉树
        965
        652
        501
        341
        341
        297
        222
        103
    二叉搜索树
        1373
        1038
        230
        538
        783
        450
        700
        701
        98
        530
        501
        95
        96
    图论算法
        图的遍历
            797
        二分图
            785
            886
        还检测、拓扑排序
            207
            210
        并查集算法
            765
            130
            990
        最小生成树
            1135
            1584
            261
        最短路径
            1514
            1631
            743
 
 暴力搜索算法
    回溯算法
        698
        494
        37
    DFS算法
        1020
        1254
        1905
        200
        694
        695
        130
    BFS算法
        773
        111
        103
 
 动态规划算法
    一维DP
        300
        354
        198
        213
        337
        45
        55
    二维DP
        1143
        583
        712
        931
        887
        787
        518
        514
        494
        416
        312
        174
        72
        64
    背包问题
        518
        494
        416
 
 其他经典算法
    数学算法
        292
        319
        877
        172
        793
        710
        645
        382
        398
        391
        372
        295
        136
        191
        231
        268
        263
        204
        134
        50
 
    区间覆盖
        1288
        56
        986
        1024
        435
        452
        1834
        
 
 
 共 130
 */


/**
 378
 395
 454
 
 */
