//
//  记录.swift
//  StudyLeetcodeProject
//
//  Created by beliefduan on 2022/9/4.
//

import Foundation


/**
 基础数据结构
     数组双指针
        - 二分搜索
            1011
            875
            793
            704
            392
            354
            74
        - 滑动窗口 ✅
        - 其他
            80
            259
            986
            18
            16
            977
            1099
     链表双指针 ✅
     前缀和
        1352
        1314
        327
        370
     队列、栈算法 ✅
     二叉堆
        1845
        1834
     数据结构设计
        1845
        895
 数据结构进阶
    二叉树
        965
        652
        501
        222
    二叉搜索树
        1373
        1038
        783
        450
        700
        701
        530
        501
        95
    图论算法
        图的遍历
            797
        二分图
            886
        并查集算法
            765
            990
        最小生成树
            1135
            1584
            261
        最短路径
            1514
            1631
            743
 
 暴力搜索算法
    回溯算法
        698
        37
    DFS算法
        1020
        1254
        1905
        694
        695
    BFS算法
        773
 
 动态规划算法
    一维DP
        354
        198
        45
    二维DP
        583
        712
        931
        887
        787
        514
        174
 
 其他经典算法
    数学算法
        319
        877
        793
        710
        645
        382
        398
        391
        372
        263
 
    区间覆盖
        986
        1024
        435
        452
        1834
 75个
 */

